{"data":{"markdownRemark":{"html":"<h2>Creating Discord Bot Application</h2>\n<p>Go to the <a href=\"https://discordapp.com/developers/applications/\">Discord Developer portal</a>.\nYou will need to login with your Discord account, that you want to be associated\nwith your bot, to create a Discord application.</p>\n<p>After you've logged in, click on the <strong>Create an application</strong> button.</p>\n<p>Here you can set some cool the name for your application, like Dark Lord or\n<em>Bastion!</em> You can also set a neat avatar for your bot that will be seen by\neveryone in Discord.</p>\n<p>Here, you will also find the <strong>Client ID</strong> of your bot. You will need this a\nfew times during the installation process. So remember to come back here when\nrequired, or save it somewhere you can always refer to.</p>\n<p>After you are done with customizing your Discord application, you will need to\ncreate a bot that will be associated with that application. To do that, go to\nthe <strong>Bot</strong> section (in the left sidebar) and then click on the <strong>Add Bot</strong>\nbutton to give your application a visible life in Discord.</p>\n<p>After your bot comes to life, you will find a few more options in there. Make\nsure to disable the <strong>Public Bot</strong> and <strong>Requires OAuth2 Code Grant</strong> options.</p>\n<h2>Inviting your Bot to Discord</h2>\n<p>You will need your bot's <strong>Client ID</strong> (remember?) during this step.</p>\n<p>Copy the following link, and replace the <code>INSERT_CLIENT_ID_HERE</code> part with your\nbot's <strong>Client ID</strong> and visit the link.</p>\n<pre><code class=\"language-diff\">https://discordapp.com/oauth2/authorize?client_id=INSERT_CLIENT_ID_HERE&#x26;scope=bot&#x26;permissions=8\n</code></pre>\n<p>You will be asked by Discord to select the server where you want to invite your\nbot. Select your server and invite your bot!</p>\n<note type=\"info\">\n  You can only invite bots to the servers where you have the **Manage Server**\n  permission. Members with **Administrator** permission have every permission\n  in the server. So, if you have that, it will do just fine.\n</note>\n<p>Now go and check out your server and you will find that your bot has joined it.</p>","frontmatter":{"title":"Prerequisites","description":null}}},"pageContext":{"slug":"/prerequisites/"}}